benchmarks/logs/2026-04-29_11-12-22/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.64ms    0.92ms  20.25ms   84.80%
    Req/Sec     1.91k   265.64     2.41k    61.17%
  Latency Distribution
     50%    2.26ms
     75%    2.77ms
     90%    4.18ms
     99%    5.79ms
  114313 requests in 30.01s, 1.21GB read
Requests/sec:   3808.98
Transfer/sec:     41.16MB